{
  "backend/main.mo": "Main Motoko canister defining user profiles, activities, messages, and access‑controlled APIs for social fitness app operations.",
  "backend/migration.mo": "Migration module converting old user profiles to the new format by adding age and fitness goals with default values.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files for reference in build planning.",
  "frontend/index.css": "Global Tailwind-based styling with custom OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Base HTML document bootstrapping the frontend and loading the React entrypoint.",
  "frontend/src/App.tsx": "Main React app wiring routes, authentication checks, onboarding redirect logic, and global providers.",
  "frontend/src/components/ActivityLogger.tsx": "Component for simulating step counts and manually logging squats and pushups via mutations.",
  "frontend/src/components/AppHeader.tsx": "Header with navigation to home or sign‑in and login/logout handling using Internet Identity.",
  "frontend/src/components/AppNav.tsx": "Top navigation bar rendering route buttons with active state based on current path.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper that shows header, conditional nav, main content, and footer based on user profile state.",
  "frontend/src/components/MessageList.tsx": "Displays messages with sender alignment, timestamps, and styling for own versus others’ messages.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Empty placeholder component file.",
  "frontend/src/components/QueryStates.tsx": "Reusable UI components for loading, error, and empty states.",
  "frontend/src/components/UserLookupForm.tsx": "Form for searching a user by principal ID and triggering an action when found.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor, recreating it on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, logout, and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks for profiles, activities, friendships, and messaging using the actor.",
  "frontend/src/index.css": "Configures Tailwind layers and defines extensive CSS variables for light and dark mode themes.",
  "frontend/src/lib/date.ts": "Provides a helper that returns today’s date formatted as YYYY-MM-DD.",
  "frontend/src/lib/sports.ts": "Defines available sports and a function mapping sport enums to display labels.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity providers.",
  "frontend/src/pages/ChatThreadPage.tsx": "Renders a chat thread with message loading, sending, scrolling, and identity checks.",
  "frontend/src/pages/DashboardPage.tsx": "Displays user profile and daily fitness goal progress using activity logs.",
  "frontend/src/pages/FollowingPage.tsx": "Manages following, followers, and user discovery with follow/unfollow actions.",
  "frontend/src/pages/FriendsPage.tsx": "Handles friends list, requests, and adding friends with accept/decline flows.",
  "frontend/src/pages/MessagesPage.tsx": "Allows opening chat threads by user ID and lists quick-access contacts.",
  "frontend/src/pages/OnboardingPage.tsx": "Renders the onboarding form for new users, validating input and creating a profile before redirecting to the dashboard. Handles auth guards and redirects based on profile state.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and edits the user’s profile information, allowing updates to name, age, goals, and sport. Includes copy-to-clipboard for the user ID.",
  "frontend/src/pages/SignInPage.tsx": "Handles login via Internet Identity and routes users to onboarding or the dashboard based on stored signup intent and profile presence.",
  "frontend/src/pages/SportSelectionPage.tsx": "Allows users to select or update their preferred sport and saves changes to their profile. Redirects unauthenticated users to sign-in.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based query params.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, and enabled plugins for the frontend build.",
  "project_state.json": "Defines current project state for the Sportified app, including architecture notes, limitations, and a list of implemented features such as user accounts, sport selection, fitness tracking, social systems, and messaging."
}